#include<iostream> // នាំចូលបណ្ណាល័យiostream សម្រាប់ប្រើប្រាស់ input និង output
using namespace std;

int main(){ // គ្រោងមុខងារចម្បង (main function) ដែលជាចំណុចចាប់ផ្តើមកម្មវិធី

    int arr[] = {1,2,3,4,5}; // កំណត់អារេ (array) arr ដែលមានទិន្នន័យ 5 មានដូចជា ៖ 1, 2, 3, 4, 5
    
    // របៀប For-loop ដើម្បីបង្ហាញតម្លៃនៃម្នាក់មួយក្នុងអារេ arr
    for(int i=0; i<5; i++){
        cout<<"arr["<<i<<"] = "<<arr[i]<<endl; // បង្ហាញតម្លៃនៃ arr[i] នៅក្នុងកម្រិតពត៌មានលើក្របខ័ណ្ឌ console
    }

    return 0; // ទ្រង់ទ្រាយ 0 ជាសញ្ញា​សម្រាប់​បញ្ចប់​​កម្មវិធីដោយជោគជ័យ
}
