#include<iostream> // នាំចូលបណ្ណាល័យiostream សម្រាប់ប្រើប្រាស់ input និង output
using namespace std;

int main(){ // គ្រោងមុខងារចម្បង (main function) ដែលជាចំណុចចាប់ផ្តើមកម្មវិធី

    int arr[] = {1,2,3,4,5}; // កំណត់អារេ (array) arr ដែលមានទិន្នន័យ 5 មានដូចជា ៖ 1, 2, 3, 4, 5
    
    // ប្តូរតម្លៃតម្លើងនៅក្នុងអារេពី i = 3 ដល់ i < 5 ដោយជំនួស arr[i] ជាមួយ arr[i+1]
    for(int i=3; i<5; i++){
        arr[i] = arr[i+1]; // ផ្លាស់ប្តូរតម្លៃ arr[i] ជាមួយ arr[i+1] ដើម្បីលុបតម្លៃ arr[3] (លុបតម្លៃតាមទីតាំង)
    }

    // របៀប For-loop ដើម្បីបង្ហាញតម្លៃនៃម្នាក់មួយក្នុងអារេ arr បន្ទាប់ពីការប្តូរតម្លៃ
    for(int i=0; i<4; i++){
        cout<<arr[i]<<" "; // បង្ហាញតម្លៃនៃ arr[i] នៅលើក្របខ័ណ្ឌ console ដោយបំបែកពីគ្នា ១ ចន្លោះ
    }

    return 0; // ទ្រង់ទ្រាយ 0 ជាសញ្ញាសម្រាប់បញ្ចប់កម្មវិធីដោយជោគជ័យ
}
