#include<iostream> // នាំចូលបណ្ណាល័យiostream សម្រាប់ប្រើប្រាស់ input និង output
using namespace std;

int main(){ // គ្រោងមុខងារចម្បង (main function) ដែលជាចំណុចចាប់ផ្តើមកម្មវិធី

    int arr[] = {1,2,3,4,5}; // កំណត់អារេ (array) arr ដែលមានទិន្នន័យ 5 មានដូចជា ៖ 1, 2, 3, 4, 5
    bool found = false; // កំណត់អថេរ `found` ដែលមានតម្លៃដំបូងជា false ដើម្បីសម្គាល់ថាតម្លៃត្រូវមិនទាន់បានរកឃើញនៅឡើយ

    // របៀប For-loop ដើម្បីស្វែងរកតម្លៃ 5 ក្នុងអារេ arr
    for(int i=0; i<5; i++){
        if(arr[i] == 5){ // បើ arr[i] មានតម្លៃ 5
            cout<<"Found at Index: "<<i<<endl; // បង្ហាញទីតាំង (index) ដែលតម្លៃ 5 ត្រូវបានរកឃើញ
            found = true; // ប្ដូរតម្លៃ `found` ជា true ដើម្បីសម្គាល់ថាតម្លៃត្រូវបានរកឃើញហើយ
            break; // បញ្ចប់ការរត់លុយម្តងនេះ (stop loop) បើរកឃើញតម្លៃ
        }
    }

    if(!found){ // បើតម្លៃ `found` នៅតែ false នេះបង្ហាញថាតម្លៃ 5 មិនបានរកឃើញទេ
        cout<<"Not found!!!"<<endl; // បង្ហាញសារថា មិនបានរកឃើញ
    }

    return 0; // ទ្រង់ទ្រាយ 0 ជាសញ្ញាសម្រាប់បញ្ចប់កម្មវិធីដោយជោគជ័យ
}
